const QuoteArray = [
  {
    quote: "Всё ему некогда, всё ему мешают, а сам лежит и ничего не делает.",
    author: "- Федор Михайлович Достоевский",
  },
  {
    quote: "Вообще-то в жизни нет ничего плохого, единственно что в ней плохо — это предсказуемость, по-моему.",
    author: "- Иосиф Бродский",
  },
  {
    quote: "Вчера ночью мучило меня вдруг пришедшее сомненье во всем. И теперь, хотя оно не мучит меня, оно сидит во мне. Зачем? и что я такое? Не раз уж мне казалось, что я решаю эти вопросы; но нет, я их не закрепил жизнью.",
    author: "- Лев Николаевич Толстой",
  },
  {
    quote: "Повышенные умственные данные налагают повышенную моральную ответственность. Чем одаренней человек, тем способнее он разлагать окружающих.",
    author: "- Олдос Хаксли",
  },
  {
    quote: "Я развитой человек, читаю разные замечательные книги, но никак не могу понять направления, чего мне, собственно, хочется, жить мне или застрелиться, собственно говоря...",
    author: "- Антон Павлович Чехов",
  },
  {
    quote: "Завтракаю - почтительно выслушиваю от мамаши, что хорошим человеком быть хорошо, а дурным – дурно. За обедом узнаю, что Бог помогает хорошим людям, а скверным не помогает.",
    author: "- Корней Иванович Чуковский",
  },
  {
    quote: 'Мы рождаемся с криком, умираем со стоном. Остается только жить со смехом.',
    author: '- Виктор Гюго'
  },
  {
    quote: 'Нужно жить всегда влюбленным во что-нибудь недоступное тебе... Человек становится выше ростом оттого, что тянется кверху.',
    author: '- Максим Горький'
  },
  {
    quote: 'Я знал двух влюблённых, живших в Петрограде в дни революции и не заметивших её.',
    author: '- Борис Леонидович Пастернак'
  },
  {
    quote: 'Единственное, что мне в вас не нравится, это ваше вечное: "Что скажут люди." "Люди" не строят вашу жизнь. А уж мою и подавно. Прежде всего думайте о себе. Вы сами должны устраивать свою жизнь. Неужели вы допустите, чтобы между вами и вашим желанием становилось то, что подумают другие?',
    author: '- Теодор Драйзер'
  },
  {
    quote: 'Во сне или ничего не видят, или видят что-нибудь интересное. Нужно научиться тому же и наяву: или ничего, или интересное.',
    author: '- Фридрих Ницше'
  },
  {
    quote: 'Ужасное состояние: все больше влюбляюсь в свою жену. Так обидно — 10 лет открещивался от своего... Бабы как бабы. А теперь унижаюсь даже до легкой ревности. Чем-то мила и сладка. И толстая.',
    author: '- Михаил Афанасьевич Булгаков'
  },
  {
    quote: "Кино не победит книги. Все эти ребята, типа Кингсли Эмиса, постоянно твердят: книга мертва, общество сползает в трясину, культура уничтожена, кругом идиоты, имбецилы, телевидение, поп-музыка, разложение, дегенерация и все такое. И тут вдруг появляется чертов Гарри Поттер — гребаная хрень на 734 страницы, которая расходится пятимиллионным тиражом за двенадцать часов. Про себя я промолчу...",
    author: "- Стивен Кинг",
  },
  {
    quote: "Быть образованным еще не значит быть умным. Нет. Но сегодня все хотят быть услышанными и в некоторых случаях неизбежно выставляют свою глупость на показ. Так что можно сказать, раньше глупость не афишировала себя, а в наше время она бунтует.",
    author: "- Умберто Эко",
  },
  {
    quote:
      "Покойнее всего было бы любить молча. Но в дело вступают сознание и личность; приходится разговаривать. И любовь превращается в ад.",
    author: "- Альбер Камю",
  },
  {
    quote:
      "Спасибо тем, кто меня любили, ибо они дали мне прелесть любить других, и спасибо тем, кто меня не любил, ибо они дали мне прелесть любить — себя.",
    author: "- Марина Цветаева",
  },
  {
    quote:
      "За все, что человек берет, он платит собой: своим умом и силой, иногда — жизнью.",
    author: "- Максим Горький",
  },
  {
    quote:
      "Как ни странно, но умение быть одному является условием способности любить.",
    author: "- Эрих Фромм",
  },
  {
    quote:
      "Когда иррациональный человек атакует, ваш первый инстинкт — ударить в ответ. Но это не сработает. Так что не считайте это атакой. Измените свое отношение, остановившись и сказав про себя: «Отличная возможность проявить самообладание». Запомните: лишить вас самообладания — один из эффективнейших приемов в арсенале иррационального человека, и ваш отказ от потери равновесия — лучшая защита.",
    author: "- Марк Гоулстон",
  },
  {
    quote:
      "Там, в мозгу, ведь нет никаких слов, чувств. Воспоминание человека — образ, записанный языком нуклеиновых кислот на макромолекулярных апериодических кристаллах.",
    author: "- Станислав Лем",
},
{
    quote:
      "Научиться красноречиво молчать труднее, чем хорошо говорить.",
    author: "- Владимир Шойхер",
},
{
    quote:
      "Если на год запереть психиатра в комнате с человеком, считающим себя Наполеоном, то кто выйдет оттуда — два нормальных человека или два Наполеона?",
    author: "- Стивен Кинг",
},
{
    quote:
      "Всю свою жизнь прилежно учись. Каждый день становись более искусным, чем ты был за день до этого, а на следующий день – более искусным, чем сегодня. Совершенствование не имеет конца.",
    author: "- Ямамото Цунэтомо",
},
{
    quote:
      "Паника, охватывающая человека, когда он в толпе и разделяет общую участь, не так ужасна, как страх, переживаемый в одиночестве.",
    author: "- Джек Лондон",
},
{
    quote:
      "Когда дружба начинает слабеть и охлаждаться, она всегда прибегает к усиленной вежливости.",
    author: "- Уильям Шекспир",
},
{
    quote:
      "Советы принимай от всех дающих, но собственное мнение береги.",
    author: "- Уильям Шекспир",
},
{
    quote:
      "Сотни верст пустынной, однообразной, выгоревшей степи не могут нагнать такого уныния, как один человек, когда он сидит, говорит и неизвестно, когда он уйдёт.",
    author: "- Антон Павлович Чехов",
},
{
    quote:
      "Каждый поглощен своими проблемами и думает только о себе. Все хотят быть услышанными, но никто не хочет слушать.",
    author: "- Анхель де Куатье",
},
{
    quote:
      "Если что-то для меня важно, я никого не слушаюсь. Даже Разума.",
    author: "- Альбер Камю",
},
{
    quote:
      "Мы все умрем. Цель — не жить вечно, цель — создать вещь, которая будет жить.",
    author: "- Чак Паланик",
},
{
    quote:
      "Я не люблю долго объяснять очевидные вещи — это раздражает меня и нарушает ход мыслей.",
    author: "- Стивен Чбоски",
},
{
    quote:
      "В жизни должна быть любовь — одна великая любовь за всю жизнь, это оправдывает беспричинные приступы отчаяния, которым мы подвержены.",
    author: "- Альбер Камю",
},
{
    quote:
      "Если вы хотите высоко подняться, пользуйтесь собственными ногами! Не позволяйте нести себя, не садитесь на чужие плечи и головы!",
    author: "- Фридрих Ницше",
},
{
    quote:
      "Если девушка приходит на свидание красивая — кто будет расстраиваться, что она опоздала?",
    author: "- Джером Сэлинджер",
},
{
    quote:
      "Товарищи воспитывают гораздо лучше, чем родители, ибо им не свойственна жалость.",
    author: "- Андре Моруа",
},
{
    quote:
      "Его раздосадовало вторжение: ведь уединение он ценил превыше всего — единственное и последнее, что осталось у него от свободы.",
    author: "- Дэвид Герберт Лоуренс",
},
{
    quote:
      "Ограниченные умы замечают ограниченность только в других.",
    author: "- Джек Лондон",
},

];
const btn = document.querySelector("input");
const span = document.querySelector("span");
const author = document.querySelector(".foot");

btn.addEventListener(
  "click",
  (randomQuote = () => {
    let rand = Math.floor(Math.random() * QuoteArray.length);
    let randQ = QuoteArray[rand];
    span.textContent = randQ.quote;
    author.textContent = randQ.author;
  })
);
